[
  {
    id: 1,
    answer: ["Please provide the name of the homeowner."],
  },
  {
    id: 2,
    answer: [
      "Please provide the resident registration number of the homeowner.",
    ],
  },
  {
    id: 3,
    answer: ["Please provide the residential address of the homeowner."],
  },
  {
    id: 4,
    answer: [
      `Document Verification`,
      `Please go to the link provided below and download the documents in PDF format for assessment to determine if there is a risk of a housing lease fraud: 
      - Certificate of Real Estate Registration: Assessing the presence of abandoned buildings
      - Building Register: Determining the status of violations in the building
      - Certificate of Tax Payment: Assessing whether the lessor has any outstanding national tax payments
      - Certificate of Local Tax Payment: Assessing whether the lessor has any outstanding local tax payments
      `,
      `Please ensure all documents are provided for thorough evaluation.`,
    ],
  },
  {
    id: 5,
    // 근데 이거는 디자인 다르게 하자! 아예 컴포넌트를 반환할까?
    answer: [
      `I have reviewed the document ‘Certificate of Real Estate Registration’. `,
      `Here are the findings:

      Check-point 01:
      The address of the building matches the address listed on the certificate of real estate registration. This is a positive result as discrepancies could indicate potential issues.
      `,
      `Check-point 02:
      The purpose of the building has been assessed, and it has been determined that it is not designated for residential use such as 'house', 'apartment', or 'Officetel'. This may pose challenges in obtaining Jeonse loans, as they are typically intended for residential properties.
      `,
      `Check-point 03:
      The presence of the term 'land ownership' has been verified in the document. It indicates either 'unregistered land ownership' or 'no land ownership.' This situation could lead to a decline in property value and the risk of eviction claims from the landowner.
      `,
      `These findings suggest potential risks associated with the property. Further investigation or clarification may be necessary before proceeding with any transactions or agreements. Let me know if you need any further assistance.`,
    ],
  },
  {
    id: 6,
    answer: [
      `I have reviewed the document ‘Certificate of Tax Payment’.`,
      `This step is to verify if the homeowner has any outstanding national tax payments.
      If the homeowner is in arrears with national taxes, the property may be seized by the National Tax Service, which directly impacts the return of the Jeonse deposit. 
      In case of auction, the unpaid taxes will be settled first, pushing back the priority of the tenant's Jeonse deposit refund.
      It has been determined that there are no records of the homeowner's tax arrears.
      Based on the review of the Certificate of Tax Payment, no signs of Jeonse fraud have been detected.
      `,
      `All document reviews have been completed.`,
      `Out of the 4 documents reviewed, Jeonse fraud risks were detected in the ‘Certificate of Real Estate Registration’ and ‘Building Register’.
      For a safe Jeonse contract, we recommend directly verifying these documents.
      To ensure a more accurate assessment of Jeonse fraud risks, you can pay 5,000 won and receive document review directly from a certified real estate agent.
      Would you like to use this paid service?
      `,
    ],
  },
  {
    id: 7,
    answer: [
      "Types of Jeonse fraud include cases where a representative engages in dual contracts or where a single house is contracted with multiple tenants.",
    ],
  },
  {
    id: 8,
    answer: [
      `The ratio of the gross floor area of a building (the total floor area, including upper floors, if any) to the land area is referred to as the "Floor Area Ratio (FAR).`,
    ],
  },
  {
    id: 9,
    answer: [
      `No, financial institutions cannot terminate a lease on behalf of a tenant. 
      Check legal basis.
      `,
    ],
  },
];